Repository: MHKarami97/Finisher
Catalog: src/Shared/Resources/Messages.*.resx
Languages: fa

source: Connection string not found
fa: کانکشن دیتابیس پیدا نشد

# ValueCanNotBeNull
source: Value cannot be null or empty
fa: مقدار مورد نظر نمی‌توان خالی باشد

# LengthBetween
source: Length must be between {0} and {1}. Current length: {2}
fa: طول مورد نظر باید بین {0} و {1} باشد. طول کنونی: {2}

# NotMatchedPattern
source: Value does not match required pattern: {0}
fa: مقدار وارد شده با پترن {0} مچ نمی‌شود

# NotDefaultValue
source: Value cannot be the default value.
fa: مقدار پیش فرض برای این مورد قابل قبول نیست

# NotNegativeOrZero
source: {0} must be greater than zero
fa: مقدار {0} باید بیشتر از صفر باشد

# InvalidEnum
source: Invalid value for enum {0}
fa: مقدار مورد نظر برای {0} قابل قبول نیست

# NotValidDateRange
source: {0} cannot be after {1}
fa: مقدار {0} نمی‌تواند بعد از {1} باشد

source: User not found
fa: کاربر مورد نظر پیدا نشد

# CurrentPasswordRequired
source: Current password is required
fa: رمز عبوری فعلی مورد نیاز است

source: Invalid verification code
fa: کد تایید وارد شده اشتباه است

source: Email confirmation failed
fa: خطا در تایید ایمیل

# ShortLengthBetween
source: Length must be between {0} and {1}
fa: طول مورد نظر باید بین {0} و {1} باشد

# GreaterThanZero
source: must be greater than zero.
fa: مقدار مورد نظر باید بیشتر از صفر باشد

# NotValidValue
source: Invalid Value
fa: مقدار مورد نظر معتبر نمی‌باشد

# NotNull
source: Value can not be null
fa: مقدار مورد نظر نمی‌تواند خالی باشد

# DateTimeLessThanOrEqual
source: Must be less than or equal to {0}
fa: زمان مورد نظر باید کمتر یا مساوی {0} باشد

# DateTimeGreaterThan
source: Must be less than {0}
fa: زمان مورد نظر باید بیشتر از {0} باشد

# MinLength
source: Minimum length is {0}
fa: حداقل طول مورد قبول {0} است

source: Invalid file type
fa: نوع فایل مورد نظر نامعتبر است

# NotValidId
source: The provided ID is not valid
fa: شناسه وارد شده معتبر نیست

# AlreadyExist
source: Item Already exists
fa: آیتمی با این مشخصات موجود می‌باشد

# AlreadyExistItem
source: Item {0} Already exists
fa: آیتم {0} با این مشخصات موجود می‌باشد

# InvalidRegex
source: Not valid value by regex
fa: مقدار وارد شده با توجه به Regex معتبر نیست

# InvalidValueFor
source: Invalid value for {0}
fa: مقدار مورد نظر برای {0} قابل قبول نیست

# NotFound
source: Item not found
fa: آیتم مورد نظر پیدا نشد

# NotFoundFor
source: Item not found for {0}
fa: آیتم مورد نظر برای {0} پیدا نشد

# TokenException
source: Token could not be decrypted
fa: امکان بدست آوردن توکن وجود ندارد

# RequiredPhone
source: Phone number is required
fa: شماره موبایل اجباری است

# ExpiredToken
source: Token is expired
fa: توکن منقضی شده است

source: Unhandled Exception
fa: خطای پیش‌بینی‌نشده در سامانه

# UnhandledExceptionUserAction
source: Please try again later. If the problem continues, contact support
fa: لطفاً کمی بعد دوباره تلاش کنید. در صورت تداوم مشکل، با پشتیبانی تماس بگیرید.

# UnauthorizedExeption
source: You need to sign in to access this resource
fa: برای دسترسی به این بخش باید وارد سامانه شوید.

# UnauthorizedExeptionUserAction
source: Sign in with a valid account and then try again
fa: با یک حساب کاربری معتبر وارد شوید و سپس دوباره تلاش کنید.

# ForbiddenExeption
source: You do not have permission to access this resource
fa: شما مجوز دسترسی به این بخش را ندارید.

# ForbiddenExeptionUserAction
source: If you believe you should have access, contact support or your administrator
fa: اگر فکر می‌کنید باید به این بخش دسترسی داشته باشید، با پشتیبانی یا مدیر سامانه تماس بگیرید.

# NotFoundExeption
source: The requested resource could not be found
fa: منبع مورد نظر پیدا نشد.

# NotFoundExeptionUserAction
source: Check the address or the item you are looking for, then try again
fa: آدرس یا موردی را که به دنبال آن هستید بررسی کنید و سپس دوباره تلاش کنید.

# BadRequestExeption
source: The request data is not valid
fa: داده‌های ارسال‌شده در درخواست معتبر نیست

# BadRequestExeptionUserAction
source: Review the entered information, correct any errors, and try again
fa: اطلاعات واردشده را بررسی کنید، خطاها را برطرف کنید و سپس دوباره تلاش کنید

source: Login
fa: ورود

source: Username
fa: نام کاربری

source: Password
fa: رمز عبور

# UsernameDescription
source: Enter Username
fa: وارد کردن نام کاربری

# PasswordDescription
source: Enter Password
fa: وارد کردن رمز عبور
